# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]  # P4/16

# darknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, Bottleneck, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 3, Bottleneck, [256]],
   [-1, 1, Conv, [256, 3, 2]],
  ]

# YOLOv3 head
head:
  [
   [-1, 1, Bottleneck, [256, False]],
   [-1, 2, Bottleneck, [256, False]],

   [6, 1, Bottleneck, [256, False]],
   [-1, 2, Bottleneck, [256, False]],

   [[11, 9], 1, Detect, [nc, anchors]],
  ]
